#define  _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
//1.有1、2、3、4个数字，能组成多少个互不相同且无重复数字的三位数？都是多少
//int main() {
//	int a, b, c;
//	int count = 0;
//	int result;
//	for (a = 1; a < 5; a++)
//	{
//		for (b = 1; b < 5; b++)
//		{
//			for (c = 1; c < 5; c++)
//			{
//				if (a != b && b != c && a != c)
//				{
//					result = a * 100 + b * 10 + c;
//					count++;
//					printf("%d，次数是%d\n", result, count);
//				}
//				else continue;
//				
//			}
//		}
//	
//	}
//	return 0;
//}

//2.企业发放的奖金根据利润提成
// 利润低于或等于10万元时，奖金可提10%
// 利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分可提成7.5%
// 20万到40万之间时，高于20万元的部分，可提成5%
// 40万到60万之间时高于40万元的部分，可提成3%
// 60万到100万之间时，高于60万元的部分，可提成1.5%
// 高于100万元时，超过100万元的部分按1%提成
// 从键盘输入月利润I，求应发放的奖金总数
//
int main() {
	long a = 0;
	long result = 0;
	scanf("%d", &a);
	if (a <= 10) printf("%ld\n", a * 10000 / 10);
	else if (a > 10 && a < 20) { 
		result = 10000 + (a - 10) * 10000 / 75;
		printf("%ld\n", result);
	}
	else if (a > 20 && a < 40) printf("%ld\n", (a - 20) * 10000 / 500 + 10000 + (a - 10) * 10000 / 75);
	else if (a > 40 && a < 60) printf("%ld\n", (a - 40) * 10000 / 300 + (a - 20) * 10000 / 500 + 10000 + (a - 10) * 10000 / 75);
	else if (a > 60 && a < 100) printf("%ld\n", (a - 60) * 10000 / 15 + (a - 40) * 10000 / 300 + (a - 20) * 10000 / 500 + 10000 + (a - 10) * 10000 / 75);
	else if (a > 100) printf("%ld\n", (a - 100) * 10000 / 100 + (a - 60) * 10000 / 15 + (a - 40) * 10000 / 300 + (a - 20) * 10000 / 500 + 10000 + (a - 10) * 10000 / 75);
	return 0;
}